Repository: BravoBaldo/Translations
Catalog: LVGL/LVGL_TradIta/LVGL_TradIta-omegat.tmx
Source language: en_us
Languages: it_it

source: It essentially provides a way to use the same native build tools across different Linux distributions.
it_it: In sostanza, fornisce un modo per utilizzare gli stessi strumenti di build nativi su diverse distribuzioni Linux.

source: It functions like any other normal display, but its content exists only in memory.
it_it: Funziona come qualsiasi altro display normale, ma il suo contenuto esiste solo in memoria.

source: It generates Makefiles or project files needed for the build.
it_it: Genera i Makefile o i file di progetto necessari per la build.

source: It generates ``screen_name_gen.c/h`` files, containing only a single ``lv_obj_t * screen_name_create(void)`` create function.
it_it: Genera file ``screen_name_gen.c/h``, contenenti una sola funzione di creazione ``lv_obj_t * screen_name_create(void)``.

source: It handles fb and lcd based display drivers, the touchscreen input driver, and libuv.
it_it: Gestisce i driver dei display basati su fb e lcd, il driver di input touchscreen e libuv.

source: It has a growing set of software libraries that can be used across various applications and industry sectors such as Industrial IoT, wearables, machine learning and more.
it_it: Dispone di un set crescente di librerie software utilizzabili in diverse applicazioni e settori industriali, come l'IoT industriale, i dispositivi indossabili, il machine learning e altro ancora.

source: It has a radius, opacity, and color to draw a rectangle.
it_it: Ha raggio, opacità e colore per disegnare un rettangolo.

source: It has been integrated into the CI automated compilation and testing process to ensure that the VG-Lite rendering backend can be fully tested after each Pull Request (PR) is merged into the repository.
it_it: È stato integrato nel processo di compilazione e test automatizzato di CI per garantire che il backend di rendering VG-Lite possa essere testato completamente dopo ogni Pull Request (PR) inserita nel repository.

source: It has been reduced to a subset of the original functionality for simple loading of blobs in LVGL.
it_it: È stato ridotto a un sottoinsieme delle funzionalità originali per il semplice caricamento di blob in LVGL.

source: It has the potential to call the driver's ``read`` fewer times than ``lv_fs_read`` is called.
it_it: Ha il potenziale di chiamare ``read`` del driver meno volte di quante ne venga chiamata ``lv_fs_read``.

source: It has to be initialized and configured with ``lv_anim_set_...()`` functions.
it_it: Deve essere inizializzato e configurato con le funzioni ``lv_anim_set_...()``.

source: It has two cores.
it_it: Ha due core.

source: It helps a lot to make LVGL more appealing for newcomers.
it_it: Aiuta molto a rendere LVGL più interessante per i nuovi arrivati.

source: It ignores comments that do not have exactly two ``*``.
it_it: Ignora i commenti che non contengono esattamente due ``*``.

source: It implements display initialization, supports display rotation and implements the display flush callback.
it_it: Implementa l'inizializzazione del display, supporta la rotazione del display e implementa la callback di flush del display.

source: It includes files such as configuration files, source code, and object files that are generated as part of the build process.
it_it: Include file come file di configurazione, codice sorgente e file oggetto generati durante il processo di compilazione.

source: It includes the following fields:
it_it: Include i seguenti campi:

source: It includes:
it_it: Include:

source: It installs the ``lv_conf.h`` header file from the source directory into the appropriate include directory in the destination path, ensuring it has the correct permissions.
it_it: Installa il file header ``lv_conf.h`` dalla directory sorgente in quella degli include appropriata nel path di destinazione, assicurandosi che abbia i permessi corretti.

source: It integrates LVGL similarly to any other Eclipse-based IDE.
it_it: Integra LVGL in modo simile a qualsiasi altro IDE basato su Eclipse.

source: It is *not itself* a Flex-Flow container, but you can make it so if you wish.
it_it: Non è *di per sé* un contenitore Flex-Flow, ma è possibile renderlo tale.

source: It is a complex descriptor with the following options:
it_it: Si tratta di un descrittore complesso con le seguenti opzioni:

source: It is a hardware-independent API that gives user space software access to the framebuffer (the part of a computer's video memory containing a current video frame) using only the Linux kernel's own basic facilities and its device file system interface, avoiding the need for libraries that implement video drivers in user space.
it_it: Si tratta di un'API indipendente dall'hardware che consente al software nello spazio utente di accedere al framebuffer (la parte della memoria video di un computer contenente un frame video corrente) utilizzando solo le funzionalità di base del kernel Linux e la sua interfaccia del file system del dispositivo, evitando la necessità di librerie che implementino i driver video nello spazio utente.

source: It is a way to extend or modify the content of the root filesystem without altering the base packages or recompiling everything.
it_it: È un modo per estendere o modificare il contenuto del filesystem di root senza alterare i pacchetti di base o ricompilare tutto.

source: It is a way to quickly use a set of predefined cmake options.
it_it: È un modo per utilizzare rapidamente un set di opzioni predefinite di CMake.

source: It is able to drive LCD panels via a highly configurable RGB interface.
it_it: È in grado di pilotare pannelli LCD tramite un'interfaccia RGB altamente configurabile.

source: It is also possible to cross-compile LVGL for an MPU (instead of compiling it on the target hardware) or create a shared library.
it_it: È anche possibile cross-compilare LVGL per una MPU (invece di compilarlo sull'hardware target) o creare una libreria shared.

source: It is also possible to define multiple previews, and in the UI |nbsp| Editor, you can select one of them.
it_it: È anche possibile definire più anteprime e nell'Editor dell'Interfaccia Utente è possibile selezionarne una.

source: It is also possible to draw SVG vector graphics in draw events:
it_it: È anche possibile disegnare grafica vettoriale SVG negli eventi di disegno:

source: It is also possible to limit the possible options the user can select from an enum.
it_it: È anche possibile limitare le possibili opzioni che l'utente può selezionare da un enum.

source: It is also possible to offset the labels from the major ticks (either positive or negative) using :cpp:expr:`lv_obj_set_style_pad_radial(scale, 5, LV_PART_INDICATOR)`
it_it: È anche possibile compensare le etichette dai segni principali (positivi o negativi) utilizzando :cpp:expr:`lv_obj_set_style_pad_radial(scale, 5, LV_PART_INDICATOR)`

source: It is also possible to set the CPU to always run on its maximum speed by setting the `CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_` option, the value of the frequency varies from chip to chip, for example P4 families support 360MHz:
it_it: È anche possibile impostare la CPU affinché funzioni sempre alla massima velocità impostando l'opzione `CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_`. Il valore della frequenza varia da chip a chip, ad esempio le famiglie P4 supportano 360 MHz:

source: It is also possible to use another rendering backend by enabling the correct options in ``lv_port_linux/lv_conf.h``.
it_it: È anche possibile utilizzare un altro backend di rendering abilitando le opzioni corrette in ``lv_port_linux/lv_conf.h``.

source: It is also possible to write custom widgets in Berry.
it_it: È anche possibile scrivere widget personalizzati in Berry.

source: It is an STM32 HAL-based driver and relies on being able to include ``"main.h"`` from within LVGL to get access to STM32 HAL definitions and function prototypes.
it_it: Si tratta di un driver basato su STM32 HAL e sulla possibilità di includere ``"main.h"`` dall'interno di LVGL per accedere alle definizioni STM32 HAL e ai prototipi di funzione.

source: It is an alternative to **Wayland**, **XCB**, **SDL** or **Qt**.
it_it: È un'alternativa a **Wayland**, **XCB**, **SDL** o **Qt**.

source: It is an enum value defined in the primary ``.h`` file for the Widget in question.
it_it: Si tratta di un valore enum definito nel file ``.h`` primario del Widget in questione.

source: It is based on ESP-IDF and uses the ESP32-S3 microcontroller.
it_it: Si basa su ESP-IDF e utilizza il microcontrollore ESP32-S3.

source: It is best not to manually set the width of the barcode, because when the width of the Widget is lower than the width of the barcode, the display will be incomplete due to truncation.
it_it: È consigliabile non impostare manualmente la larghezza del codice a barre, perché, quando la larghezza del Widget è inferiore a quella del codice a barre, la visualizzazione risulterà incompleta a causa del troncamento.

source: It is designed for lower-performance embedded devices.
it_it: È progettato per dispositivi embedded a basse prestazioni.

source: It is designed to automatically generate timing and data signals for different LCD panels.
it_it: È progettata per generare automaticamente segnali di temporizzazione e dati per diversi pannelli LCD.

source: It is designed to simplify the development, deployment, and maintenance of applications, especially in industrial and IoT settings.
it_it: È progettato per semplificare lo sviluppo, l'implementazione e la manutenzione delle applicazioni, in particolare in ambito industriale e IoT.

source: It is equivalent to the number of older siblings in the parent.
it_it: Equivale al numero di elementi figlio maggiori nel widget padre.

source: It is exposed via the Linux device file system interface.
it_it: Viene esposto tramite l'interfaccia del file system del device Linux.

source: It is here that you can observe and edit the contents of any file in your project, but its specialty is editing XML that defines UI components (:ref:`xml_widgets`, :ref:`xml_components` and :ref:`xml_screens`).
it_it: È qui che si può osservare e modificare il contenuto di qualsiasi file nel progetto, ma la sua specialità è la modifica dell'XML che definisce i componenti dell'interfaccia utente (:ref:`xml_widgets`, :ref:`xml_components` e :ref:`xml_screens`).

source: It is however important to create detailed issues when a problem is encountered, logs and screenshots of the problem are of great help.
it_it: È tuttavia importante creare problemi dettagliati quando si riscontra un problema; log e screenshot del problema sono di grande aiuto.

source: It is important to distinguish between :dfn:`Widgets`, :dfn:`Components`, and :dfn:`Screens`.
it_it: È importante distinguere tra :dfn:`Widget`, :dfn:`Componenti` e :dfn:`Screen` [schermate].

source: It is important to understand that this generic MIPI LCD driver is not a hardware driver for displays with the DSI ("MIPI") serial interface.
it_it: È importante comprendere che questo driver LCD MIPI generico non è un driver hardware per display con interfaccia seriale DSI ("MIPI").

source: It is intended for testing purposes and can be used if you are already familiar with Buildroot concepts and architecture.
it_it: È pensato per scopi di test e può essere utilizzato se si ha già familiarità con i concetti e l'architettura di Buildroot.

source: It is more for collecting the docstrings than anything else.
it_it: Serve più per raccogliere le docstring che altro.

source: It is not detailed below, but you can do this by changing the prefix of the functions from ``lv_obj_`` to ``lv_display_`` or ``lv_indev_``.
it_it: Non viene spiegato in dettaglio di seguito, ma è possibile farlo modificando il prefisso delle funzioni da ``lv_obj_`` a ``lv_display_`` o ``lv_indev_``.

source: It is not mandatory, but we highly appreciate it if you write a few words about your project in the `My projects <https://forum.lvgl.io/c/my-projects/10>`__ category of the forum or a private message to `lvgl.io <https://lvgl.io/#contact>`__.
it_it: Non è obbligatorio, ma apprezzeremmo molto se si scrivesse qualche parola sul proprio progetto nella categoria `My projects <https://forum.lvgl.io/c/my-projects/10>`__ del forum o si inviasse un messaggio privato a `lvgl.io <https://lvgl.io/#contact>`__.

source: It is not necessary to do a commit to test the hooks, you can test hooks by adding the files into the staging area and run:
it_it: Non è necessario eseguire un commit per testare gli hook, si possono testare aggiungendo i file nell'area di staging ed eseguendo:

source: It is only limited by available RAM and MCU time.
it_it: È limitato solo dalla RAM disponibile e dal tempo MCU.

source: It is possible to create a per-chip default confiuration files by creating A configuration default files which starts to the chip variant, for example `sdkconfig.esp32p4` will only apply the default configuration for an ESP32-P4 IDF project.
it_it: È possibile creare file di configurazione predefiniti per ogni chip creando un file di configurazione di default che inizia con la variante del chip, ad esempio `sdkconfig.esp32p4` applicherà la configurazione predefinita solo per un progetto IDF ESP32-P4.

source: It is possible to make a Widget non-scrollable with :cpp:expr:`lv_obj_remove_flag(widget, LV_OBJ_FLAG_SCROLLABLE)`.
it_it: È possibile rendere un Widget non-scrollable con :cpp:expr:`lv_obj_remove_flag(widget, LV_OBJ_FLAG_SCROLLABLE)`.

source: It is possible to perceive an increase up to 30% of overall speed execution increment.
it_it: È possibile percepire un aumento fino al 30% della velocità di esecuzione complessiva.

source: It is possible to run multiple, independent instances of LVGL.
it_it: È possibile eseguire più istanze indipendenti di LVGL.

source: It is possible to set indicator angle directly with any of these functions:
it_it: È possibile impostare l'angolo dell'indicatore direttamente con una qualsiasi di queste funzioni:

source: It is provided with limited rights of use as outlined below.
it_it: È fornita con diritti d'uso limitati come descritto di seguito.

source: It is recommended to add :cpp:func:`lv_test_wait` after user actions to ensure that the new state and coordinates are read and applied from the input device.
it_it: Si consiglia di aggiungere :cpp:func:`lv_test_wait` dopo le azioni dell'utente per garantire che il nuovo stato e le nuove coordinate vengano letti e applicati dal dispositivo di input.

source: It is recommended to enable it in Debug mode and disable it in the Release version.
it_it: Si consiglia di abilitarlo in modalità Debug e di disabilitarlo nella versione Release.

source: It is recommended to enable this configuration in scenarios where the shadow quality requirements are not high, as it can significantly improve rendering efficiency.
it_it: Si consiglia di abilitare questa configurazione in scenari in cui i requisiti di qualità delle ombre non sono elevati, in quanto può migliorare significativamente l'efficienza di rendering.

source: It is recommended to get familiar with VSCode IDE extension as it will simplify your workflow.
it_it: Si consiglia di familiarizzare con l'estensione IDE VSCode, poiché semplificherà il flusso di lavoro.

source: It is recommended to use AC6 or LLVM when dealing with Helium code.
it_it: Si consiglia di utilizzare AC6 o LLVM quando si utilizza codice Helium.

source: It is recommended to use the internal ThorVG library to ensure uniform rendering results.
it_it: Si consiglia di utilizzare la libreria ThorVG interna per garantire risultati di rendering uniformi.

source: It is responsible for assigning a value to the Widget's ``id`` field.
it_it: È responsabile dell'assegnazione di un valore al campo ``id`` del Widget.

source: It is safe to call it multiple times.
it_it: È possibile richiamarlo più volte.

source: It is scalable from 8-bit to 64-bit microcontrollers and microprocessors and compliant with the Portable Operating System Interface (POSIX) and the American National Standards Institute (ANSI) standards and with many Linux-like subsystems.
it_it: È scalabile da microcontrollori e microprocessori da 8 bit a 64 bit ed è conforme agli standard Portable Operating System Interface (POSIX) e American National Standards Institute (ANSI), nonché a molti sottosistemi simili a Linux.

source: It is set to :cpp:enumerator:`LV_COLOR_FORMAT_ARGB8888` by default.
it_it: È impostato su :cpp:enumerator:`LV_COLOR_FORMAT_ARGB8888` per default.

source: It is set to be FLEX GROW 1, so if it is the only Label in the header, it will occupy all available space after any Buttons are added.
it_it: È impostato su FLEX GROW 1, quindi se è l'unica Label nell'intestazione, occuperà tutto lo spazio disponibile dopo l'aggiunta di eventuali Pulsanti.

source: It is simpler, out of the box, runs with no porting and configuration at all, does not depend on OS or file system, has good support for popular IDEs for Windows platforms like Keil, IAR, RT-Thread-Studio, and of course, supports Linux gcc development platforms.
it_it: È più semplice, pronto all'uso, funziona senza alcun porting o configurazione, non dipende dal sistema operativo o dal file system, offre un buon supporto per gli IDE più diffusi per piattaforme Windows come Keil, IAR, RT-Thread-Studio e, naturalmente, supporta le piattaforme di sviluppo Linux gcc.

source: It is suitable for packaging XML files into your app.
it_it: È adatto per impacchettare file XML nell'app.

source: It is the 'A' in the various color formats that contain an alpha channel, such as ARGB8888, ARGB8565, ARGB1555, etc.
it_it: È la 'A' nei vari formati colore che contengono un canale alfa, come ARGB8888, ARGB8565, ARGB1555, ecc.

source: It is the user's responsibility to implement this either by polling the hardware, polling a global variable (which is reset at the end of the transfer), or by using a semaphore or other locking mechanism.
it_it: È responsabilità dell'utente implementare questa funzionalità interrogando l'hardware, interrogando una variabile globale (che viene reimpostata al termine del trasferimento) o utilizzando un semaforo o un altro meccanismo di blocco.

source: It is the user's responsibility to set up the clock, timers, peripherals, etc.
it_it: È responsabilità dell'utente configurare il clock, i timer, le periferiche, ecc.

source: It is typically labeled as sda or sdb, but you can use the lsblk command to confirm this information.
it_it: In genere è etichettata come sda o sdb, ma si può usare il comando lsblk per confermare questa informazione.

source: It is used by all LVGL defconfigs.
it_it: Viene utilizzata da tutte le configurazioni di LVGL.

source: It is used in the ``"fields"`` array of the ``"struct"`` and ``"union"`` types covered below.
it_it: Viene utilizzato nell'array ``"fields"`` dei tipi ``"struct"`` ``"union"`` trattati di seguito.

source: It is used to easily integrate a project/library into another project.
it_it: Viene utilizzato per integrare facilmente un progetto/libreria in un altro progetto.

source: It is very convenient to apply this to LVGL Widgets in your user interface (UI), to change their appearance, size or location over time.
it_it: È molto comodo applicarlo ai Widget LVGL nell'interfaccia utente (UI), per modificarne l'aspetto, le dimensioni o la posizione nel tempo.

source: It is where the actual building and compiling of individual packages or recipes takes place.
it_it: È qui che avviene la build e la compilazione effettiva dei singoli pacchetti o ricette.

source: It is widely used in Chinese social life, helping people understand the dates of the lunar calendar, arrange festival activities, and inherit the excellent traditional culture of the Chinese nation.
it_it: È ampiamente utilizzato nella vita sociale cinese, aiutando le persone a comprendere le date del calendario lunare, a organizzare le attività festive e a ereditare l'eccellente cultura tradizionale della nazione cinese.

source: It leverages GStreamer's powerful pipeline architecture to handle media decoding, processing, and rendering.
it_it: Sfrutta la potente architettura di pipeline di GStreamer per gestire la decodifica, l'elaborazione e il rendering dei contenuti multimediali.

source: It makes the content area smaller in this direction.
it_it: Riduce l'area del contenuto in questa direzione.

source: It may contain compilers, build tools, and libraries that are required to support the build process for the target.
it_it: Può contenere compilatori, strumenti di compilazione e librerie necessari per supportare il processo di compilazione per il sistema target.

source: It may not support DSPI or QSPI currently.
it_it: Questa potrebbe non supportare DSPI o QSPI.

source: It means, 128: slow down the rotary to half, 512: speeds up to double, 256: no change
it_it: Con significato: 128: rallenta la rotazione della metà, 512: raddoppia la velocità, 256: nessuna modifica

source: It might be a good idea to use different style elements for different states.
it_it: Potrebbe essere una buona idea utilizzare elementi di stile diversi per stati diversi.

source: It might be counterintuitive in some cases, so the y coordinates can be inverted with :cpp:expr:`lv_line_set_y_invert(line, true)`.
it_it: Potrebbe essere controintuitivo in alcuni casi, quindi le coordinate y possono essere invertite con :cpp:expr:`lv_line_set_y_invert(line, true)`.

source: It might be necessary to change the mkttf.py script.
it_it: Potrebbe essere necessario modificare lo script mkttf.py.

source: It might be scary to make the first step but you have nothing to be afraid of.
it_it: Potrebbe spaventare fare il primo passo, ma non c'è nulla di cui aver paura.

source: It might make sense to create and delete items in a loop many times and add a small tolerance to the memory leakage test.
it_it: Potrebbe essere opportuno creare ed eliminare elementi in un ciclo più volte e aggiungere una piccola tolleranza al test di perdita di memoria.

source: It must not be enabled at the same time as :c:macro:`LV_USE_DRAW_DMA2D`.
it_it: Non deve essere abilitato contemporaneamente a :c:macro:`LV_USE_DRAW_DMA2D`.

source: It natively supports the embedded NeoChrom GPU thanks to LVGL's support for :ref:`NeoChrom <neochrom>`.
it_it: Supporta nativamente la GPU NeoChrom embedded grazie al supporto LVGL per :ref:`NeoChrom <neochrom>`.

source: It needs to perform the clean-up for any resources allocated by :cpp:func:`lv_obj_assign_id`.
it_it: È necessario eseguire la pulizia di tutte le risorse allocate da :cpp:func:`lv_obj_assign_id`.

source: It picks the first project that:
it_it: Sceglierà il primo progetto che:

source: It prepares some files as a prior step to flashing.
it_it: Vengono preparati alcuni file come passaggio preliminare al flashing.

source: It provides a revised, modern and capable interface set and focuses on ease-of-use, robustness and being future-proof.
it_it: Offre un set di interfacce rivisitato, moderno e funzionale, puntando su facilità d'uso, robustezza e compatibilità con le esigenze future.

source: It provides an interface to `Samsung/rlottie <https://github.com/Samsung/rlottie>`__ library's C API.
it_it: Fornisce un'interfaccia all'API C della libreria `Samsung/rlottie <https://github.com/Samsung/rlottie>`__.

source: It relies on the STM32 HAL to detect information about the configuration.
it_it: Si basa sull'HAL STM32 per rilevare informazioni sulla configurazione.

source: It renders the children there and blends it by setting ``clip_radius`` to the layer.
it_it: Esegue il rendering degli elementi figlio in queste aree e li fonde impostando ``clip_radius`` sul layer.
